src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ITЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ITЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/КатегорииЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КатегорииЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание категории</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетОборудование</Name>
					<Comment>Нужно ли обязательно указывать оборудование в заявке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/HTTPServices/ServiceDeskAPI/Ext/Module.bsl
Функция PingGET(Запрос)
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("status", "ok");
	ДанныеОтвета.Вставить("service", "ServiceDeskAPI");
	ДанныеОтвета.Вставить("message", "Service Desk API is available");

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);

	ТелоОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(200);

	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);

	Возврат Ответ;

КонецФункции

Функция TicketGET(Запрос)
	НомерЗаявки = Запрос.ПараметрыURL.Получить("number");

	Если НомерЗаявки = Неопределено Тогда
		Возврат СформироватьОтветСОшибкой(400, "Не указан номер заявки.");
	КонецЕсли;

	НомерЗаявки = СокрЛП(НомерЗаявки);

	Если ПустаяСтрока(НомерЗаявки) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Не указан номер заявки.");
	КонецЕсли;

	Попытка
		ЗапросКБазе = Новый Запрос;
		ЗапросКБазе.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ITЗаявка.Номер КАК Номер,
			|	ITЗаявка.Дата КАК Дата,
			|	ITЗаявка.Заявитель КАК Заявитель,
			|	ITЗаявка.Категория КАК Категория,
			|	ITЗаявка.Приоритет КАК Приоритет,
			|	ITЗаявка.ТекущийСтатус КАК ТекущийСтатус,
			|	ITЗаявка.Исполнитель КАК Исполнитель,
			|	ITЗаявка.ОписаниеПроблемы КАК ОписаниеПроблемы,
			|	ITЗаявка.Оборудование КАК Оборудование,
			|	ITЗаявка.СрокРеакции КАК СрокРеакции,
			|	ITЗаявка.СрокРешения КАК СрокРешения
			|ИЗ
			|	Документ.ITЗаявка КАК ITЗаявка
			|ГДЕ
			|	ITЗаявка.Номер = &Номер
			|	И ITЗаявка.ПометкаУдаления = ЛОЖЬ";

		ЗапросКБазе.УстановитьПараметр(
			"Номер",
			НомерЗаявки
		);

		Выборка = ЗапросКБазе.Выполнить().Выбрать();

	Исключение
		Возврат СформироватьОтветСОшибкой(500, "Не удалось получить данные заявки.");
	КонецПопытки;

	Если НЕ Выборка.Следующий() Тогда
		Возврат СформироватьОтветСОшибкой(404, "Заявка с номером " + НомерЗаявки + " не найдена.");
	КонецЕсли;

	Если НЕ РольДоступна("АдминистраторСистемы") И НЕ РольДоступна("РуководительITОтдела") Тогда
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();

		Если НЕ ЗначениеЗаполнено(ТекущийСотрудник) Тогда
			Возврат СформироватьОтветСОшибкой(403, "Текущий пользователь ИБ не связан с активным сотрудником.");
		КонецЕсли;

		Если Выборка.Заявитель <> ТекущийСотрудник И Выборка.Исполнитель <> ТекущийСотрудник Тогда
			Возврат СформироватьОтветСОшибкой(403, "Недостаточно прав для просмотра этой заявки.");
		КонецЕсли;
	КонецЕсли;

	ДанныеЗаявки = Новый Структура;
	ДанныеЗаявки.Вставить("number", Выборка.Номер);
	ДанныеЗаявки.Вставить("date", ДатаДляJSON(Выборка.Дата));
	ДанныеЗаявки.Вставить("applicant", ПредставлениеДляJSON(Выборка.Заявитель));
	ДанныеЗаявки.Вставить("category", ПредставлениеДляJSON(Выборка.Категория));
	ДанныеЗаявки.Вставить("priority", ПредставлениеДляJSON(Выборка.Приоритет));
	ДанныеЗаявки.Вставить("status", ПредставлениеДляJSON(Выборка.ТекущийСтатус));
	ДанныеЗаявки.Вставить("executor", ПредставлениеДляJSON(Выборка.Исполнитель));
	ДанныеЗаявки.Вставить("description", Выборка.ОписаниеПроблемы);
	ДанныеЗаявки.Вставить("equipment", ПредставлениеДляJSON(Выборка.Оборудование));
	ДанныеЗаявки.Вставить("reactionDeadline", ДатаДляJSON(Выборка.СрокРеакции));
	ДанныеЗаявки.Вставить("solutionDeadline", ДатаДляJSON(Выборка.СрокРешения));

	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("success", Истина);
	ДанныеОтвета.Вставить("ticket", ДанныеЗаявки);

	Возврат СформироватьJSONОтвет(200, ДанныеОтвета);
КонецФункции 

Функция СформироватьJSONОтвет(КодСостояния, Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Данные);

	ТелоОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);

	Возврат Ответ;

КонецФункции

Функция СформироватьОтветСОшибкой(КодСостояния, ТекстОшибки)

	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("success", Ложь);
	ДанныеОтвета.Вставить("error", ТекстОшибки);

	Возврат СформироватьJSONОтвет(КодСостояния, ДанныеОтвета);

КонецФункции

Функция ПредставлениеДляJSON(Значение)

	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;

	Возврат Строка(Значение);

КонецФункции

Функция ДатаДляJSON(ЗначениеДаты)

	Если НЕ ЗначениеЗаполнено(ЗначениеДаты) Тогда
		Возврат "";
	КонецЕсли;

	Возврат Формат(ЗначениеДаты, "ДФ=yyyy-MM-dd'T'HH:mm:ss");

КонецФункции

Функция TicketsPOST(Запрос)

	// 1. Получаем и разбираем JSON из тела HTTP-запроса.
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();

		Если ПустаяСтрока(ТелоЗапроса) Тогда
			Возврат СформироватьОтветСОшибкой(400, "Тело запроса не заполнено.");
		КонецЕсли;

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);

		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);

		ЧтениеJSON.Закрыть();

	Исключение
		Возврат СформироватьОтветСОшибкой(400, "Передан некорректный JSON.");
	КонецПопытки;

	Если ТипЗнч(ДанныеЗапроса) <> Тип("Структура") Тогда
		Возврат СформироватьОтветСОшибкой(400, "В теле запроса должен находиться объект JSON.");
	КонецЕсли;   

	КодКатегории = "";
	ИмяПриоритета = "";
	ОписаниеПроблемы = "";
	ПолученныйКодОборудования = "";

	// 2. Получаем обязательные поля. 
	
	Заявитель = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
	
	Если НЕ ЗначениеЗаполнено(Заявитель) Тогда
		Возврат СформироватьОтветСОшибкой(403, "Текущий пользователь ИБ не связан с активным сотрудником.");
	КонецЕсли;

	Если НЕ ДанныеЗапроса.Свойство("categoryCode", КодКатегории) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Не указано поле categoryCode.");
	КонецЕсли;

	КодКатегории = СокрЛП(Строка(КодКатегории));

	Если ПустаяСтрока(КодКатегории) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Поле categoryCode не должно быть пустым.");
	КонецЕсли;

	Если НЕ ДанныеЗапроса.Свойство("priority", ИмяПриоритета) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Не указано поле priority.");
	КонецЕсли;

	ИмяПриоритета = СокрЛП(Строка(ИмяПриоритета));

	Если ПустаяСтрока(ИмяПриоритета) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Поле priority не должно быть пустым.");
	КонецЕсли;

	Если НЕ ДанныеЗапроса.Свойство("description", ОписаниеПроблемы) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Не указано поле description.");
	КонецЕсли;

	ОписаниеПроблемы = СокрЛП(Строка(ОписаниеПроблемы));

	Если ПустаяСтрока(ОписаниеПроблемы) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Описание проблемы не должно быть пустым.");
	КонецЕсли;

	// 3. Получаем необязательное оборудование.

	КодОборудования = "";

	Если ДанныеЗапроса.Свойство("equipmentCode", ПолученныйКодОборудования) Тогда
		КодОборудования = СокрЛП(Строка(ПолученныйКодОборудования));
	КонецЕсли;

	// 4. Находим ссылки на элементы справочников.

	Категория = Справочники.КатегорииЗаявок.НайтиПоКоду(КодКатегории, Истина);

	Если НЕ ЗначениеЗаполнено(Категория) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Категория с кодом " + КодКатегории + " не найдена.");
	КонецЕсли;

	Приоритет = ПолучитьПриоритетПоСтроке(ИмяПриоритета);

	Если Приоритет = Неопределено Тогда
		Возврат СформироватьОтветСОшибкой(400, "Приоритет """ + ИмяПриоритета + """ не найден.");
	КонецЕсли;

	Оборудование = Справочники.Оборудование.ПустаяСсылка();

	Если НЕ ПустаяСтрока(КодОборудования) Тогда
		Оборудование = Справочники.Оборудование.НайтиПоКоду(КодОборудования, Истина);

		Если НЕ ЗначениеЗаполнено(Оборудование) Тогда
			Возврат СформироватьОтветСОшибкой(400, "Оборудование с кодом " + КодОборудования + " не найдено.");
		КонецЕсли;
	КонецЕсли;

	Если Категория.ТребуетОборудование И НЕ ЗначениеЗаполнено(Оборудование) Тогда
		Возврат СформироватьОтветСОшибкой(400, "Для выбранной категории необходимо указать equipmentCode.");
	КонецЕсли;

	// 5. Создаём документ ITЗаявка.

	Попытка
		НоваяЗаявка = Документы.ITЗаявка.СоздатьДокумент();
		НоваяЗаявка.Дата = ТекущаяДатаСеанса();
		НоваяЗаявка.Заявитель = Заявитель;
		НоваяЗаявка.Категория = Категория;
		НоваяЗаявка.Приоритет = Приоритет;
  		НоваяЗаявка.ОписаниеПроблемы = ОписаниеПроблемы;
		НоваяЗаявка.Оборудование = Оборудование;
		НоваяЗаявка.ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая;
		НоваяЗаявка.Записать(РежимЗаписиДокумента.Запись);

	Исключение
		Возврат СформироватьОтветСОшибкой(500, "Не удалось создать заявку. " + ОписаниеОшибки());
	КонецПопытки;

	// 6. Формируем ответ о созданной заявке.

	ДанныеЗаявки = Новый Структура;
	ДанныеЗаявки.Вставить("number", НоваяЗаявка.Номер);
	ДанныеЗаявки.Вставить("date", ДатаДляJSON(НоваяЗаявка.Дата));
	ДанныеЗаявки.Вставить("applicant", ПредставлениеДляJSON(НоваяЗаявка.Заявитель));
	ДанныеЗаявки.Вставить("category", ПредставлениеДляJSON(НоваяЗаявка.Категория));
	ДанныеЗаявки.Вставить("priority", ПредставлениеДляJSON(НоваяЗаявка.Приоритет));
	ДанныеЗаявки.Вставить("status", ПредставлениеДляJSON(НоваяЗаявка.ТекущийСтатус));
	ДанныеЗаявки.Вставить("equipment", ПредставлениеДляJSON(НоваяЗаявка.Оборудование));
	ДанныеЗаявки.Вставить("reactionDeadline", ДатаДляJSON(НоваяЗаявка.СрокРеакции));
	ДанныеЗаявки.Вставить("solutionDeadline", ДатаДляJSON(НоваяЗаявка.СрокРешения));

	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("success", Истина);
	ДанныеОтвета.Вставить("ticket", ДанныеЗаявки);

	Ответ = СформироватьJSONОтвет(201, ДанныеОтвета);

	Ответ.Заголовки.Вставить("Location", "/ServiceDesk/hs/api/v1/tickets/" + НоваяЗаявка.Номер);

	Возврат Ответ;

КонецФункции       

Функция ПолучитьПриоритетПоСтроке(ИмяПриоритета)

	ИмяПриоритета = СокрЛП(Строка(ИмяПриоритета));

	Приоритет = Справочники.ПриоритетыЗаявок.НайтиПоНаименованию(ИмяПриоритета, Истина);

	Если НЕ ЗначениеЗаполнено(Приоритет) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Приоритет;

КонецФункции
